---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.Get(Autodesk.Revit.DB.Document,System.Guid)
source: html/8efdf937-b1ee-b911-e213-8deb99d534ec.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.Get Method

Returns an Alignment in the document given its GUID.

## Syntax (C#)
```csharp
public static Alignment Get(
	Document document,
	Guid guid
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document for which the alignment is returned.
- **guid** (`System.Guid`) - The unique identifier of the Alignment.